{
    "workouts": [
        {
            "name": "Summer Workout",
            "muscles": ["arms", "chest", "abs"],
            "exercises": [
                {
                    "id" :17,
                    "name" : "Barbell Full Squat",
                    "images" : [
                        "https://www.bodybuilding.com/exercises/exerciseImages/sequences/64/Male/m/64_2.jpg",
                        "https://www.bodybuilding.com/exercises/exerciseImages/sequences/64/Male/m/64_1.jpg"
                    ],
                    "instructions": [
                        "This exercise is best performed inside a squat rack for safety purposes. To begin, first set the bar on a rack just above shoulder level. Once the correct height is chosen and the bar is loaded, step under the bar and place the back of your shoulders (slightly below the neck) across it.",
                        "Hold on to the bar using both arms at each side and lift it off the rack by first pushing with your legs and at the same time straightening your torso.",
                        "Step away from the rack and position your legs using a shoulder-width medium stance with the toes slightly pointed out. Keep your head up at all times and maintain a straight back. This will be your starting position.",
                        "Begin to slowly lower the bar by bending the knees and sitting back with your hips as you maintain a straight posture with the head up. Continue down until your hamstrings are on your calves. Inhale as you perform this portion of the movement.",
                        "Begin to raise the bar as you exhale by pushing the floor with the heel or middle of your foot as you straighten the legs and extend the hips to go back to the starting position.",
                        "Repeat for the recommended amount of repetitions.",
                        "This type of squat allows a greater range of motion, and allows the trunk to maintain a more vertical position than other types of squats, due to foot position and the higher bar position."
                    ],
                    "muscles" : ["Quadriceps"],
                    "equipment" : "Barbell",
                    "muscle_diagram" : "https://artifacts.bbcomcdn.com/exercises-app/1.2.1/img/guide-7.gif",
                    "sets": [{"reps": 8,  "weight": 25}, {"reps": 8,  "weight": 25},{"reps": 8,  "weight": 25}]
                },
                {
                    "id" :2,
                    "name" : "Barbell Bench Press - Medium Grip",
                    "images" : ["https://www.bodybuilding.com/exercises/exerciseImages/sequences/360/Male/m/360_1.jpg","https://www.bodybuilding.com/exercises/exerciseImages/sequences/360/Male/m/360_2.jpg"],
                    "instructions": [
                        "Stand up with your torso upright while holding an E-Z Curl Bar at the closer inner handle. The palm of your hands should be facing forward and they should be slightly tilted inwards due to the shape of the bar. The elbows should be close to the torso. This will be your starting position.",
                        "While holding the upper arms stationary, curl the weights forward while contracting the biceps as you breathe out. Tip: Only the forearms should move.",
                        "Continue the movement until your biceps are fully contracted and the bar is at shoulder level. Hold the contracted position for a second and squeeze the biceps hard.",
                        "Slowly begin to bring the bar back to starting position as your breathe in.",
                        "Repeat for the recommended amount of repetitions."
                    ],
                    "muscles" : ["Chest"],
                    "equipment" : "Barbell",
                    "muscle_diagram" : "https://artifacts.bbcomcdn.com/exercises-app/1.2.1/img/guide-1.gif",
                    "sets": [{"reps": 8,  "weight": 25}, {"reps": 8,  "weight": 25},{"reps": 8,  "weight": 25}]
                },
                {
                    "id" :6,
                    "name" : "Lying Supine Dumbbell Curl",
                    "images" : [
                        "https://www.bodybuilding.com/exercises/exerciseImages/sequences/212/Male/l/212_1.jpg",
                        "https://www.bodybuilding.com/exercises/exerciseImages/sequences/212/Male/l/212_3.jpg",
                        "https://www.bodybuilding.com/exercises/exerciseImages/sequences/212/Male/l/212_2.jpg"
                    ],
                    "instructions": [
                        "Lie down on a flat bench face up while holding a dumbbell in each arm on top of your thighs.",
                        "Bring the dumbbells to the sides with the arms extended and the palms of the hands facing your thighs (neutral grip).",
                        "While keeping the arms close to your torso and elbows in, slowly lower your arms (as you keep them extended with a slight bend at the elbows) as far down towards the floor as you can go. Once you cannot go down any further, lock your upper arms in that position and that will be your starting position.",
                        "As you breathe out, slowly begin to curl the weights up as you simultaneously rotate your wrists so that the palms of the hands face up. Continue curling the weight until your biceps are fully contracted and squeeze hard at the top position for a second. Tip: Only the forearms should move. Upper arms should remain stationary and elbows should stay in throughout the movement.",
                        "Return back to the starting position very slowly."
                    ],
                    "muscles" : ["Biceps"],
                    "equipment" : "Dumbbell",
                    "muscle_diagram" : "https://artifacts.bbcomcdn.com/exercises-app/1.2.1/img/guide-15.gif",
                    "sets": [{"reps": 8,  "weight": 25}, {"reps": 8,  "weight": 25},{"reps": 8,  "weight": 25}]}
            ]
        }
    ]
}